In [1]:
#Aim: Salary Prediction using Linear Regreesion

In [2]:
#Experiment No: 4
#Name:Rohit Dadgal
#Roll No: 18 
#Subject: Data Science Statistic

In [2]:
import pandas as pd 
from matplotlib import pyplot as pl
 
import seaborn as sea

In [3]:
import os

In [4]:
os.getcwd()

'C:\\Users\\Rohit\\Desktop'

In [5]:
os.chdir("C:\\Users\\Rohit\\Desktop")

In [6]:
df=pd.read_csv("Salary_dataset.csv")

In [7]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [8]:
df.tail()

    YearsExperience  Salary
30             11.2  127345
31             11.5  126756
32             12.3  128765
33             12.9  135675
34             13.5  139465

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  35 non-null     float64
 1   Salary           35 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 688.0 bytes

In [10]:
df.describe()

       YearsExperience         Salary
count        35.000000      35.000000
mean          6.308571   83945.600000
std           3.618610   32162.673003
min           1.100000   37731.000000
25%           3.450000   57019.000000
50%           5.300000   81363.000000
75%           9.250000  113223.500000
max          13.500000  139465.000000

In [11]:
df.shape

(35, 2)

In [12]:
df.size

70

In [13]:
df.ndim

2

In [14]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [15]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [16]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [17]:
df.loc[4,"Salary"]

39891

In [18]:
df.head(15)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111

In [19]:
df.loc[4]

YearsExperience        2.2
Salary             39891.0
Name: 4, dtype: float64

In [20]:
a=(1,2,3,4,5,6,7,8,9,10)

In [21]:
a[1:4]

(2, 3, 4)

In [32]:
df.iloc[1,2]

IndexError: index 2 is out of bounds for axis 0 with size 2

In [23]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [24]:
df.loc[1,"Salary"]

46205

In [25]:
x=df.iloc[:, :-1].values 
y=df.iloc[:, :-1].values

In [26]:
a=(1,2,3,4,5,6,7,8,9,10)

In [27]:
a[:2]

(1, 2)

In [28]:
a[2:]

(3, 4, 5, 6, 7, 8, 9, 10)

In [29]:
a[1:6:1]

(2, 3, 4, 5, 6)

In [30]:
print(x)

[[ 1.1]
 [ 1.3]
 [ 1.5]
 [ 2. ]
 [ 2.2]
 [ 2.9]
 [ 3. ]
 [ 3.2]
 [ 3.2]
 [ 3.7]
 [ 3.9]
 [ 4. ]
 [ 4. ]
 [ 4.1]
 [ 4.5]
 [ 4.9]
 [ 5.1]
 [ 5.3]
 [ 5.9]
 [ 6. ]
 [ 6.8]
 [ 7.1]
 [ 7.9]
 [ 8.2]
 [ 8.7]
 [ 9. ]
 [ 9.5]
 [ 9.6]
 [10.3]
 [10.5]
 [11.2]
 [11.5]
 [12.3]
 [12.9]
 [13.5]]

In [31]:
print(y)

[[ 1.1]
 [ 1.3]
 [ 1.5]
 [ 2. ]
 [ 2.2]
 [ 2.9]
 [ 3. ]
 [ 3.2]
 [ 3.2]
 [ 3.7]
 [ 3.9]
 [ 4. ]
 [ 4. ]
 [ 4.1]
 [ 4.5]
 [ 4.9]
 [ 5.1]
 [ 5.3]
 [ 5.9]
 [ 6. ]
 [ 6.8]
 [ 7.1]
 [ 7.9]
 [ 8.2]
 [ 8.7]
 [ 9. ]
 [ 9.5]
 [ 9.6]
 [10.3]
 [10.5]
 [11.2]
 [11.5]
 [12.3]
 [12.9]
 [13.5]]